{
  "homework": "Homework 3 (Due on 25th March) Please refer to G.WAS book as discussed in the class (https://link.springer.com/book/10.1007/978-3-540-49472-0)",
  "questions": [
    {
      "question_id": "q1a",
      "question_text": "Using the relativistic expression for electron-atom energy transfer, calculate the minimum electron energy required to displace an atom in Al. Assume threshold displacement energies of 25 eV for Al.",
      "student_answer": "Olamide Olabiyi NE 62041 Homework #03\n\nQuestion (1)\nRelativistic electron-atom energy transfer.\nMomentum of an electron with rest mass M₀ and K.E E is:\nPₑ² = Eᵢ(Eᵢ + 2m₀c²) / c²\n⇒ T = 2Eᵢ(Eᵢ + 2m₀c²) sin² ∅ / 2 ⇒ T = 2Eᵢ(Eᵢ + 2m₀c²) / M₀c²\nEᵢ (the minimum electron energy required to displace an atom) = ?\nT = Energy transferred in collision\n↑ = Maximum energy transferred\n\nHowever, since the minimum electron energy required to displace an atom in Al and Ta has to be equal or greater than the displacement energies.\nHence, T = Eₗ\nALUMINUM (Al)\nM₀ = 0.51099894 MeV/c², c = speed of light, M = 26.9815389 amu\nEₗ = ? 1 amu = 931.5 MeV/c², Eᵢ = 25xV = 25x10⁶ MeV\n↑ = 2Eᵢ(Eᵢ + 2m₀c²) / Mc²\n25x10⁶ MeV = 2Eᵢ(Eᵢ + 2 x 0.51099894 MeV x c²) / 26.981538 x 931.5 MeV/c²xc²\n25x10⁶ x 26.981538 x 931.5 MeV = (2Eᵢ² + 2.04399576 Eᵢ) MeV\n1\n\nOlamide Olabiyi NE 6241 Homework #03.\n⇒ 0.6283325662 = 2Eᵢ² + 2.04399576 Eᵢ\n2Eᵢ² + 2.04399576 Eᵢ - 0.6283325662 = 0\nSOLVED to be\nEᵢ(1) = 0.24747 MeV or Eᵢ(2) = -1.26947 MeV\nHowever, the minimum electron energy required cannot be negative or less than the threshold displacement energies.\nEᵢ(Al) = 0.24747 MeV",
      "reference_answer": "Minimum energy for e⁻ required to displace an atom\n\n(a) Al with Ed = 25 eV and A = 27\n(in MeV)\nEd/A = 2*Ee*(Ee + 2*mec²) / mc² = 2147.7 * Ee * (Ee + 1.022)\n\n(in eV)\nA*Ed/2147.7 = Ee² + 1.022*Ee\n\nor\n\nEe² + 1.022*Ee - (A*Ed/2147) = 0\n                                            0.3144\n\nax² + bx + c = 0\nX₁₂ = (-b ± √(b² - 4ac)) / 2a   => Ee = (-1.022 ± √((1.022)² + (4)(1)(0.3144))) / 2\n\n=> Ee = 248 KeV      Aluminum",
      "max_marks": 5,
      "rubric": "2 points for setting up the relativistic energy transfer equation correctly. 1 point for correctly substituting the values. 1 point for solving the quadratic equation. 1 point for the correct answer within the range of 230 KeV to 260 KeV. Deduct 0.5 points for minor calculation errors. Deduct 1 point if units are missing or incorrect."
    },
    {
      "question_id": "q1b",
      "question_text": "Using the relativistic expression for electron-atom energy transfer, calculate the minimum electron energy required to displace an atom in Ta. Assume threshold displacement energies of 90 eV for Ta.",
      "student_answer": "TANTALUM (Ta)\nMₜ = 180.947999 amu, Eₗ = ?, 1 amu = 931.5 MeV/c², Eₗ = 90 eV = 90x10⁻⁶ MeV\nT = 2Eᵢ(Eᵢ + 2m₀c²) / Mc²\n90x10⁻⁶ MeV = 2Eᵢ(Eᵢ + 2 x 0.51099894 MeV/c²xc²) / 180.947999 x 931.5 MeV/c²xc²\n90x10⁻⁶ x 180.947999 x 931.5 MeV = (2Eᵢ² + 2.04399576 Eᵢ) MeV\n⇒ 15.11697755 = 2Eᵢ² + 2.04399576 Eᵢ\n⇒ 2Eᵢ² + 2.04399574 Eᵢ - 15.11697755 = 0\nSOLVED to be\nEᵢ(1) = 2.29007 MeV or Eᵢ(2) = -3.31207 MeV\nEᵢ(Ta) = 2.29007 MeV",
      "reference_answer": "(b) Ta with Ed = 90 eV and A = 181\n\nEe = (-1.022 ± √((1.022)² + 4*A*Ed/2147.7)) / 2 =  (-1.022 ± √((1.022)² + 30.339)) / 2\n\n=> Ee = 2.29 MeV  Tantalum",
      "max_marks": 5,
      "rubric": "2 points for setting up the relativistic energy transfer equation correctly. 1 point for correctly substituting the values. 1 point for solving the quadratic equation. 1 point for the correct answer within the range of 2.1 MeV to 2.4 MeV. Deduct 0.5 points for minor calculation errors. Deduct 1 point if units are missing or incorrect."
    },
    {
      "question_id": "q2",
      "question_text": "5 MeV Al ions are used to irradiate an Al sample. Determine whether these conditions represent the “high-energy” or “low-energy” regime for electronic stopping/ionization interactions in solids by comparing the electron orbital velocity of the bound electrons (Eq. 2.49 in lecture notes section 2.3) with the ion velocity (Eq. 2.47 in lecture notes). Using the appropriate electronic stopping power approximation, calculate the ion energy as a function of distance from the surface and determine the approximate range of the Al ions in Al. (see textbook for a convenient approximate relationship between the distance traveled by the ion R and the projected range Rp).",
      "student_answer": "2\n\nOlamide Olabiyi NE 6241 Homework #03\nQuestion (2)\n5 MeV Al ions\nDetermining whether the conditions of the irradiation process above represent the \"high-energy\" or \"low-energy\" regime for electronic stopping or ionization interactions in solids.\n\nUsing eq. (2.49) and eq. (2.47) for comparison\nThe average velocity of the bound electrons is:\nVₑ, bound (m/s) ≈ 2.2x10⁶ (Zᵢ)⅔ ⇒ eqn (2.49)\n\nThe ion velocity\nVᵢ(m/s) = √(2(eV) (1.6x10⁻¹⁹ J/eV) / (1.66x10⁻²⁷ kg) mᵢ(amu)) = 1.41x10⁴ √(E(eV) / mᵢ(amu)) ⇒ eqn (2.47)\nE = 5 MeV = 5x10⁶ eV, mᵢ = 26.981538, Zᵢ = 13\nVₑ, bound (m/s) ≈ 2.2x10⁶ x (13)⅔\nVₑ, bound = 1.2163 x 10⁷ m/s\n\nVᵢ(m/s) = 1.41x10⁴ √(5x10⁶ (eV) / 26.981538 (amu)) ⇒ 6.0697 x 10⁶ m/s.\n\nSince the Velocity of the ion is less than the electron orbital velocity of the bound electrons, the given conditions fall in the low-energy regime.\n3\n\nOlamide Olabiyi NE 6241 Homework #03\nQuestion (2)\nCalculating the ion energy as a function of distance from the surface and determining the approximate range of the Al ions in Al.\n\nSince Vᵢ < Vₑ, bound, the energy loss to electrons represent the low energy regime.\n(dE / dx) = KEᵢ½, K = 0.03NZ⅔ eV½/nm\n(-dE / dx)ₑ = KEᵢ½ since 0 < 5000 (keV) < 1.812 (keV)\nFrom 0 < E(keV) < 37Z⅔\nN(Al) = 6.022 x 10²² atoms/cm³, Z = 13\nK = 0.03 x 6.022 x 10²² x 13⅔ eV½/nm\nK = 9.956 x 10²¹ eV½/nm\nE½ = 1 / K (-dE / dx)ₑ\nE½ = 1 / 9.956 x 10²¹ eV½/nm (-dE / dx)ₑ\nE = 1.00117 x 10⁻²² (-dE / dx)ₑ\nE = 1.000586 x 10⁻²¹ (-dE / dx)ₑ eV\n4\n\nOlamide Olabiyi NE 6241 Homework #03.\nQuestion (2)\nDetermining the approximate range of the Al ions in Al\n↳ At low energies, dSₙ ≈ dSₑ and then Rₚ < R\nSince M₁ = M₂, M₂ / M₁ = 1; R / Rₚ ≈ 1.6\nR = 1.6 Rₚ R = 1.6\nUsing Rₚ = R / (1 + (M₂ / 3M₁))\nRₚ = 1.6 / (1 + 1 / 3) ⇒ 1.6 / 1.3333 = 1.2 nm",
      "reference_answer": "5) 5-MeV Al ions on Al sample.\n\nVe,bound (m/s) = 2.2 x 10⁶ (Z)⅔   average velocity of bound electron.\n\nVion (m/s) = 1.41 x 10⁴ √(E(eV) / m₁ (amu))   ion velocity at kinetic energy E\n\n=> Ve,bound = 2.2 x 10⁶ (13)⅔ = 1.22 x 10⁷ m/s\n\nVion = 1.41 x 10⁴ * √(5 x 10⁶ / 27) = 6.067674 x 10⁶ m/s\n\n=> Vion << Ve,bound   low-energy ion approximation is valid\n\nAlternatively, use Was's eq 1.182 stating that low energy electronic stopping is valid for like atoms when\n\n0 < E (keV) < 37 (Z)⅔  => 0 < E < 5 MeV < 14.7 keV\nk ~ 0.3 N ⅔\n\nlow-energy approximation for dE/dx is valid!\n\ndE/dx = -kE½  => dE/E½ = -k dx\n\n∫ dE/E½ = -k ∫ dx\n\n2[(Ei)½ - (E(x))½ ] = kx\n\nE(x) = (Ei)½ - (kx/2)²\n\nN atoms/cm³ = (6.022 x 10²³) atoms/mol * 2.7 g/cm³ / 27 g/mol = 6.022 x 10²² atoms/cm³\n\n= 0.06022 atoms/Å³\n\nK = 0.3 N ⅔   with [K] = (eV)½ / Å\n\nK = (0.3)(0.06)(13)⅔\n\nK = 0.1 eV½/Å\n\nRange:  x = R for which (E(x) = 0)\n\n=> (Ei)½ = kR/2\n\n=> R = 2(Ei)½ / k = 2(5 x 10⁶)½ / 0.1\n\n=> R = 44,721 Å = 4.472 µm      ion Range\n\nThis estimation ignores energy loss due to nuclear collisions (and associated range), which becomes dominant process if Al slows down to ~80 keV => However, this produces an overall error < 10%! on range.",
      "max_marks": 10,
      "rubric": "2 points for correctly calculating the electron orbital velocity and ion velocity. 1 point for correctly identifying the low-energy regime. 2 points for using the correct electronic stopping power approximation (dE/dx = -kE½). 2 points for deriving the ion energy as a function of distance. 2 points for calculating the range of the Al ions in Al. 1 point for a range within 4.0 um to 5.0 um. Deduct 0.5 points for minor calculation errors. Deduct 1 point if units are missing or incorrect."
    },
    {
      "question_id": "q3",
      "question_text": "Consider channeling of a recoil atom along the [100] direction in a simple cubic lattice with a lattice constant of 0.3 nm. The minimum channeling energy is 200 eV. What is the maximum injection angle for a 2 keV recoil entering along the axis to undergo channeling?",
      "student_answer": "5\n\nOlamide Olabiyi NE 6241 Homework #03.\n\nQuestion (3)\nChanneling of a recoil atom along the [100] direction in a simple cubic lattice.\na₀ = 0.3 nm = 0.3 x 10⁻⁹ m, E<ch = 200 eV, ∅₀<max = ?, E<ch = 2 keV = 2 x 10³ eV\nR<ch = a₀ / √(2π√2) ⇒ 0.3 x 10⁻⁹ / √(2π√2) ⇒ 1.0064 x 10⁻¹⁰ m\nQ<max = R<ch √(k / E₀)\nK = π / Ich = (2π R<ch)½ / Ich e^(-πr²/ p) , r = a₀ / 2 = 0.3 nm / 2 = 0.15 nm = 0.15 x 10⁻⁹ m\nIch = a₀ / √2 = 0.3 nm / √2 = 0.2121 nm = 0.2121 x 10⁻⁹ m\nK = 1 / (0.2121 x 10⁻⁹) (2π x 1.0064 x 10⁻¹⁰)½ e^((-π x 0.15 x 10⁻⁹)² / (0.3 x 10⁻⁹))\nK = 2.3685 x 10¹¹ eV/m²\n∅₀<max = 1.0064 x 10⁻¹⁰ √(2.3685 x 10¹¹ / 2000)\n∅₀<max = 0.010951972 rad",
      "reference_answer": "6) Channeling along [100] direction in simple cubic lattice\n\nwith a₀ = 0.3 nm\nEch = 200 eV\nT = 2 keV\n\nπRch² = a₀²\n\nor Rch = a₀/√π from eq (M) lecture slides\n\nR = π * Ech / a₀²\n\nSubstitute into equ. (L) in lecture slides:\n\nθch = a₀/√π * √π * Ech / √a₀² * T = √ π * Ech / T * 200 / 2000 = 0.56 radians\n\nθch = 32°\n\nCritical angle for channeling (max. angle)",
      "max_marks": 10,
      "rubric": "3 points for correctly identifying the relevant equations for channeling. 2 points for calculating the critical radius. 3 points for substituting values and calculating the critical angle in radians. 2 points for converting the angle to degrees. Correct answer should be within 30 to 34 degrees. Deduct 0.5 points for minor calculation errors. Deduct 1 point if units are missing or incorrect."
    },
    {
      "question_id": "q4",
      "question_text": "A 50-keV copper ion enters a channel in a copper lattice, and thus loses energy only by electronic stopping. Determine whether the Lindhard (low-energy) or Bethe-Bohr (high-energy) stopping power formula is more appropriate, and then determine the distance traveled by the ion before it is de-channeled, assuming a minimum channeling energy of 300 eV.",
      "student_answer": "6\n\nOlamide Olabiyi NE 6241 Homework #03\nQuestion (7)\n50 keV Copper ion, E<ch = 300 eV, K = 0.03 N Z⅔ eV½/nm\nDetermination of energy regime.\nVᵢ(m/s) = 1.41 x 10⁴ √(E(eV) / mᵢ(amu)) & Vₑ, bound(m/s) ≈ 2.2 x 10⁶ (Zᵢ)⅔\nE = 50 keV, mᵢ = 64.927790 amu, Zᵢ = 29\nVᵢ(m/s) = 1.41 x 10⁴ √(50 x 10³ (eV) / 64.927790 (amu)) = 3.9128 x 10⁵ m/s\n\nVₑ, bound(m/s) ≈ 2.2 x 10⁶ x (29)⅔ = 2.0756 x 10⁷ m/s\nSince Vᵢ < Vₑ, bound, the Lindhard-Schauff stopping power is used\nN = 8.5 x 10²⁸ atoms/m³ ⇒ 8.5 x 10⁵⁵ atoms/nm³\n(dE / dx)ₑ = KEᵢ½\nK = 0.03 x 8.5 x 10⁵⁵ x 29⅔ eV½/nm\nK = 2.4069 x 10⁵⁵ eV½/nm\n\n(dE / dx)ₑ = 2.4069 x 10⁵⁵ Eᵢ½ / nm x 50 x 10³ eV = 1.2035 x 10⁶⁰ / nm",
      "reference_answer": "7) 50-keV Copper in Copper for 50 keV under \"normal\" conditions, we would need to include elastic collisions @ 50-keV.  BUT: Channeling => no nuclear collisions in the channel so we can neglect!\n\nFollow procedure as in question 5\n\nVion = 4.0 x 10⁵ m/s < Ve,bound = 2.1 x 10⁷ m/s\n\nLow-energy electronic stopping approximation is valid (Lindhard)\n\nSame Range equation as in 5 but now minimum energy is the channeling energy:\n\n∫ dE/E½ = -K ∫ dx => E(x) = [(Ei)½ - (kx/2)²]² => x = [(Ei)½ - (Ech)½] / K\n\nK = 0.3 (N) (Z)⅔ N = (6.022 x 10²³) / 64 g * 8.96 g/cm³ = 8.43 x 10²²\n\n=> N = 0.0843 atoms/Å³\n\nK = (0.3) (0.0843) (29)⅔\n\nK = 0.2387 √(eV)/Å\n\nR = (√(50,000) - √(300)).2/0.2387\n\nR = 1728 Å = 172.8 nm\n\nWithout channeling the actual range would be ~ 30 nm, as a 50 keV Cu recoil has mainly nuclear collisions!\n\nRange associated with channeling much higher than actual range as nuclear collisions are absent during channeling!",
      "max_marks": 10,
      "rubric": "2 points for correctly identifying the low-energy regime and Lindhard stopping power. 2 points for calculating the electronic stopping parameter K. 3 points for setting up the integral and deriving the distance traveled equation considering the channeling energy. 3 points for a final answer within the range of 160 nm to 185 nm. Deduct 0.5 points for minor calculation errors. Deduct 1 point if units are missing or incorrect."
    },
    {
      "question_id": "q5",
      "question_text": "Summarize the three major radiation mixing (ion-ion collision) mechanisms (also sometimes called ion beam mixing). What are the operative time frames for the different mechanisms? Which mechanism is typically most important for energetic massive ions? What is a typical value for the amount of mixing per dpa (“replacements per atom”) for energetic displacement cascade conditions (>10 keV PKAs)?",
      "student_answer": "7\n\nOlamide Olabiyi NE 6241 Homework #03\nQuestion 5.\nIon Beam mixing is an ion irradiation method used in the modification of metal surfaces so as to alter the composition of the target material.\n\nThe three major Ion Beam missing methods are as follows:\n• Recoil Implantation\n• Cascade Mixing\n• Thermal Spike\n\nRecoil Implantation\nThis occurs when an incoming ion beam hits a target sample of an atom and thereby imparting the momentum from the incoming ion to the atoms of the sample. However, the distribution of the momentum on the atoms is not uniform and the knock-on atoms end up being relocated in the beam direction based on preference.\n\nSince the target sample is a solid, there is an equilibrium in the overall movement of the atoms. The operative time frame for Recoil Implantation is in the order of 10⁻¹⁴ which is just the beginning of the radiation mixing process and it occurs rapidly beyond human eyes observation. Recoil implantation thereby has the least mixing effect for this reason.\n\nCascade Mixing\nIn this Ion Beam mixing technique, the energy transfer from the recoiling atoms from recoil implantation is rapid with the operative time frame being in the order of 10⁻¹³ seconds. The cascade mixing leads to effective uniformization of the mixing after recoil implantation which enhances the implantation of ion. The cascade propagation time is in of the order 10⁻¹⁴ and the quench time, is 10⁻¹² seconds.\n\nThis is also the mechanism that is most important for energetic massive ions.\nThe typical value for mixing per dpa for energetic displacement cascade conditions is in the range of 1-10 displacements per atom.\n\nThermal Spike\nThis is the most dominant component of radiation mixing. This is the point where the cascades from the cascade mixing begin to reduce and tend to randomly cause spikes or melting in random locations with the concentration of energy at such point. This will then lead to a more random mixing because of the spike in energy which enhances atomic mobility.\n\nThe operative time frame for this mechanism is in the order of 10⁻¹¹ seconds which is slower than both the recoil implantation and cascade mixing mechanisms but still fast enough beyond ordinary observation.\n8",
      "reference_answer": "8) Three major radiation mixing:\n\n1) RECOIL IMPLANTATION (t ~ 10⁻¹⁴ s) \"moving long ways\" associated with primary recoil atom events\n\n2) CASCADE MIXING (t ~ 10⁻¹³ s) associated with initial ballistic stage during cascade formation (described by binary collisions)\n\n3) THERMAL SPIKE (t ~ 10⁻¹¹ s) atomic mixing during relatively long cooling period associated with the thermal spike.\n=> Dominant mechanisms for typical cascades being 1 order of magnitude larger than other two mechanisms. Mixing per dpa for energetic cascades is ~50 replacements (see OECD report Figures)",
      "max_marks": 10,
      "rubric": "3 points for correctly listing and describing the three major radiation mixing mechanisms. 3 points for correctly stating the approximate time frames for each mechanism. 2 points for correctly identifying thermal spike/cascade mixing as the most important for energetic massive ions. 2 points for providing a reasonable value for mixing per dpa (40-60 replacements). Deduct 1 point for missing one of the mixing mechanisms or incorrect time scales."
    }
  ]
}